---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudTotalWeight
source: html/c17128a3-60fc-55a8-8061-d0d583fafa8b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudTotalWeight Property

"Total Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemShearstudTotalWeight { get; }
```